CASE_I/standard/fine/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          controlDict;
}

libs            ( overset fvMotionSolvers );

application     overPimpleDyMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         40100;

deltaT          0.1;

writeControl    adjustableRunTime;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.5;

dim_r0          0.05;

dim_r1          0.15;

dim_ros         0.1;

Nimp1           18;

Nimp2           36;

Ntank1          36;

Ntank2          18;

Gimp            ( ( 0.015 0.4444 3 ) ( 0.035 0.5556 1 ) );

Gtank           ( ( 0.035 0.5556 1 ) ( 0.015 0.4444 0.333 ) );

U_rad           0.02;

data_cp         4180;

data_k          0.6;

data_rho        1000;

data_nu         1e-06;

data_alpha      1.43e-07;

functions
{
    divergence
    {
        type            div;
        libs            ( fieldFunctionObjects );
        field           U;
        result          divU;
        writeControl    writeTime;
    }
    forces
    {
        type            forces;
        libs            ( forces );
        writeControl    runTime;
        writeInterval   5;
        log             false;
        patches         ( hole );
        p               p;
        U               U;
        rho             rhoInf;
        rhoInf          1000;
        porosity        no;
        CofR            ( 0 0 0 );
        pitchAxis       ( 0 0 1 );
    }
    coordinateTransform
    {
        type            fieldCoordinateSystemTransform;
        libs            ( fieldFunctionObjects );
        log             true;
        writeControl    writeTime;
        fields          ( U );
        coordinateSystem
        {
            type            cylindrical;
            origin          ( 0 0 0 );
            rotation
            {
                type            cylindrical;
                axis            ( 0 0 1 );
            }
        }
    }
}


// ************************************************************************* //
